cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>EUSCI_A0</name>
        <version>356.0</version>
        <description>EUSCI_A0</description>
        <baseAddress>0x40001000</baseAddress>
        <interrupt>
            <name>EUSCIA0_IRQ</name>
            <description>EUSCIA0 Interrupt</description>
            <value>16</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x20</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>UCAxCTLW0</name>
                  <displayName>CTLW0</displayName>
                  <description>eUSCI_Ax Control Word Register 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000001</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCSWRST</name>
                        <description>Software reset enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSWRST_0</name>
                                <description>Disabled. eUSCI_A reset released for operation</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSWRST_1</name>
                                <description>Enabled. eUSCI_A logic held in reset state</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXBRK</name>
                        <description>Transmit break</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXBRK_0</name>
                                <description>Next frame transmitted is not a break</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXBRK_1</name>
                                <description>Next frame transmitted is a break or a break/synch</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXADDR</name>
                        <description>Transmit address</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXADDR_0</name>
                                <description>Next frame transmitted is data</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXADDR_1</name>
                                <description>Next frame transmitted is an address</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCDORM</name>
                        <description>Dormant</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCDORM_0</name>
                                <description>Not dormant. All received characters set UCRXIFG.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCDORM_1</name>
                                <description>Dormant. Only characters that are preceded by an idle-line or with address bit set UCRXIFG. In UART mode with automatic baud-rate detection, only the combination of a break and synch field sets UCRXIFG.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCBRKIE</name>
                        <description>Receive break character interrupt enable</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCBRKIE_0</name>
                                <description>Received break characters do not set UCRXIFG</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCBRKIE_1</name>
                                <description>Received break characters set UCRXIFG</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCRXEIE</name>
                        <description>Receive erroneous-character interrupt enable</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCRXEIE_0</name>
                                <description>Erroneous characters rejected and UCRXIFG is not set</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCRXEIE_1</name>
                                <description>Erroneous characters received set UCRXIFG</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSSEL</name>
                        <description>eUSCI_A clock source select</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSSEL_0</name>
                                <description>UCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSSEL_1</name>
                                <description>ACLK</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSSEL_2</name>
                                <description>SMCLK</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSYNC</name>
                        <description>Synchronous mode enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSYNC_0</name>
                                <description>Asynchronous mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSYNC_1</name>
                                <description>Synchronous mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCMODE</name>
                        <description>eUSCI_A mode</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCMODE_0</name>
                                <description>UART mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMODE_1</name>
                                <description>Idle-line multiprocessor mode</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMODE_2</name>
                                <description>Address-bit multiprocessor mode</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMODE_3</name>
                                <description>UART mode with automatic baud-rate detection</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSPB</name>
                        <description>Stop bit select</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSPB_0</name>
                                <description>One stop bit</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSPB_1</name>
                                <description>Two stop bits</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UC7BIT</name>
                        <description>Character length</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UC7BIT_0</name>
                                <description>8-bit data</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UC7BIT_1</name>
                                <description>7-bit data</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCMSB</name>
                        <description>MSB first select</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCMSB_0</name>
                                <description>LSB first</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCMSB_1</name>
                                <description>MSB first</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCPAR</name>
                        <description>Parity select</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCPAR_0</name>
                                <description>Odd parity</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCPAR_1</name>
                                <description>Even parity</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCPEN</name>
                        <description>Parity enable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCPEN_0</name>
                                <description>Parity disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCPEN_1</name>
                                <description>Parity enabled. Parity bit is generated (UCAxTXD) and expected (UCAxRXD). In address-bit multiprocessor mode, the address bit is included in the parity calculation.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCAxCTLW1</name>
                  <displayName>CTLW1</displayName>
                  <description>eUSCI_Ax Control Word Register 1</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000003</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCGLIT</name>
                        <description>Deglitch time</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCGLIT_0</name>
                                <description>Approximately 2 ns (equivalent of 1 delay element)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGLIT_1</name>
                                <description>Approximately 50 ns</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGLIT_2</name>
                                <description>Approximately 100 ns</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCGLIT_3</name>
                                <description>Approximately 200 ns</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCAxBRW</name>
                  <displayName>BRW</displayName>
                  <description>eUSCI_Ax Baud Rate Control Word Register</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x000000ff</resetMask>
                  <fields>
                    <field>
                        <name>UCBR</name>
                        <description>Clock prescaler setting of the Baud rate generator</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCAxMCTLW</name>
                  <displayName>MCTLW</displayName>
                  <description>eUSCI_Ax Modulation Control Word Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCOS16</name>
                        <description>Oversampling mode enabled</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCOS16_0</name>
                                <description>Disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCOS16_1</name>
                                <description>Enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCBRF</name>
                        <description>First modulation stage select</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UCBRS</name>
                        <description>Second modulation stage select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
