cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
                            <enumeratedValue>
                                <name>CEREFL_1</name>
                                <description>1.2 V is selected as shared reference voltage input</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREFL_2</name>
                                <description>2.0 V is selected as shared reference voltage input</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREFL_3</name>
                                <description>2.5 V is selected as shared reference voltage input</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEREFACC</name>
                        <description>Reference accuracy</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEREFACC_0</name>
                                <description>Static mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREFACC_1</name>
                                <description>Clocked (low power, low accuracy) mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CExCTL3</name>
                  <displayName>CTL3</displayName>
                  <description>Comparator Control Register 3</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CEPD0</name>
                        <description>Port disable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD0_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD0_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD1</name>
                        <description>Port disable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD1_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD1_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD2</name>
                        <description>Port disable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD2_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD2_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD3</name>
                        <description>Port disable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD3_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD3_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD4</name>
                        <description>Port disable</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD4_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD4_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD5</name>
                        <description>Port disable</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD5_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD5_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD6</name>
                        <description>Port disable</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD6_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD6_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD7</name>
                        <description>Port disable</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD7_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD7_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD8</name>
                        <description>Port disable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD8_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD8_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD9</name>
                        <description>Port disable</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD9_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD9_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD10</name>
                        <description>Port disable</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD10_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD10_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD11</name>
                        <description>Port disable</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD11_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD11_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD12</name>
                        <description>Port disable</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD12_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD12_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD13</name>
                        <description>Port disable</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD13_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD13_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD14</name>
                        <description>Port disable</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD14_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD14_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPD15</name>
                        <description>Port disable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPD15_0</name>
                                <description>The input buffer is enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPD15_1</name>
                                <description>The input buffer is disabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
