cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
            <register>
                  <name>RTCBIN2BCD</name>
                  <displayName>BIN2BCD</displayName>
                  <description>Binary-to-BCD Conversion Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>BIN2BCD</name>
                        <description>bin to bcd conversion</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RTCBCD2BIN</name>
                  <displayName>BCD2BIN</displayName>
                  <description>BCD-to-Binary Conversion Register</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>BCD2BIN</name>
                        <description>bcd to bin conversion</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>WDT_A</name>
        <version>356.0</version>
        <description>WDT_A</description>
        <baseAddress>0x40004800</baseAddress>
        <interrupt>
            <name>WDT_A_IRQ</name>
            <description>WDT_A Interrupt</description>
            <value>3</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0xE</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>WDTCTL</name>
                  <displayName>CTL</displayName>
                  <description>Watchdog Timer Control Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00006904</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>WDTIS</name>
                        <description>Watchdog timer interval select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>WDTIS_0</name>
                                <description>Watchdog clock source / (2^(31)) (18:12:16 at 32.768 kHz)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTIS_1</name>
                                <description>Watchdog clock source /(2^(27)) (01:08:16 at 32.768 kHz)</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTIS_2</name>
                                <description>Watchdog clock source /(2^(23)) (00:04:16 at 32.768 kHz)</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTIS_3</name>
                                <description>Watchdog clock source /(2^(19)) (00:00:16 at 32.768 kHz)</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTIS_4</name>
                                <description>Watchdog clock source /(2^(15)) (1 s at 32.768 kHz)</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTIS_5</name>
                                <description>Watchdog clock source / (2^(13)) (250 ms at 32.768 kHz)</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTIS_6</name>
                                <description>Watchdog clock source / (2^(9)) (15.625 ms at 32.768 kHz)</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTIS_7</name>
                                <description>Watchdog clock source / (2^(6)) (1.95 ms at 32.768 kHz)</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WDTCNTCL</name>
                        <description>Watchdog timer counter clear</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>WDTCNTCL_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>WDTCNTCL_0</name>
                                <description>No action</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTCNTCL_1</name>
                                <description>WDTCNT = 0000h</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WDTTMSEL</name>
                        <description>Watchdog timer mode select</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>WDTTMSEL_0</name>
                                <description>Watchdog mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTTMSEL_1</name>
                                <description>Interval timer mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WDTSSEL</name>
                        <description>Watchdog timer clock source select</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>WDTSSEL_0</name>
                                <description>SMCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTSSEL_1</name>
                                <description>ACLK</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTSSEL_2</name>
                                <description>VLOCLK</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTSSEL_3</name>
                                <description>BCLK</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WDTHOLD</name>
                        <description>Watchdog timer hold</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>WDTHOLD_0</name>
                                <description>Watchdog timer is not stopped</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WDTHOLD_1</name>
                                <description>Watchdog timer is stopped</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WDTPW</name>
                        <description>Watchdog timer password</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
