cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
            <register>
                  <name>PCMCLRIFG</name>
                  <displayName>CLRIFG</displayName>
                  <description>Clear Interrupt Flag Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLR_LPM_INVALID_TR_IFG</name>
                        <description>Clear LPM invalid transition flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CLR_LPM_INVALID_CLK_IFG</name>
                        <description>Clear LPM invalid clock flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CLR_AM_INVALID_TR_IFG</name>
                        <description>Clear active mode invalid transition flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CLR_DCDC_ERROR_IFG</name>
                        <description>Clear DC-DC error flag</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>CS</name>
        <version>356.0</version>
        <description>CS</description>
        <baseAddress>0x40010400</baseAddress>
        <interrupt>
            <name>CS_IRQ</name>
            <description>CS Interrupt</description>
            <value>1</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x68</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>CSKEY</name>
                  <displayName>KEY</displayName>
                  <description>Key Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x0000a596</resetValue>
                  <fields>
                    <field>
                        <name>CSKEY</name>
                        <description>Write xxxx_695Ah to unlock</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CSCTL0</name>
                  <displayName>CTL0</displayName>
                  <description>Control 0 Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00010000</resetValue>
                  <fields>
                    <field>
                        <name>DCOTUNE</name>
                        <description>DCO frequency tuning select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0xA</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DCORSEL</name>
                        <description>DCO frequency range select</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DCORSEL_0</name>
                                <description>Nominal DCO Frequency Range (MHz): 1 to 2</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCORSEL_1</name>
                                <description>Nominal DCO Frequency Range (MHz): 2 to 4</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCORSEL_2</name>
                                <description>Nominal DCO Frequency Range (MHz): 4 to 8</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCORSEL_3</name>
                                <description>Nominal DCO Frequency Range (MHz): 8 to 16</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCORSEL_4</name>
                                <description>Nominal DCO Frequency Range (MHz): 16 to 32</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCORSEL_5</name>
                                <description>Nominal DCO Frequency Range (MHz): 32 to 64</description>
                                <value>5</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DCORES</name>
                        <description>Enables the DCO external resistor mode</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DCORES_0</name>
                                <description>Internal resistor mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCORES_1</name>
                                <description>External resistor mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DCOEN</name>
                        <description>Enables the DCO oscillator</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DCOEN_0</name>
                                <description>DCO is on if it is used as a source for MCLK, HSMCLK , or SMCLK and clock is requested, otherwise it is disabled.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCOEN_1</name>
                                <description>DCO is on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CSCTL1</name>
                  <displayName>CTL1</displayName>
                  <description>Control 1 Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000033</resetValue>
                  <fields>
                    <field>
                        <name>SELM</name>
                        <description>Selects the MCLK source</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SELM_0</name>
                                <description>when LFXT available, otherwise REFOCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELM_1</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELM_2</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELM_3</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELM_4</name>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELM_5</name>
                                <description>when HFXT available, otherwise DCOCLK</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELM_6</name>
                                <description>when HFXT2 available, otherwise DCOCLK</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELM_7</name>
                                <description>for future use. Defaults to DCOCLK. Not recommended for use
to ensure future compatibilities.</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SELS</name>
                        <description>Selects the SMCLK and HSMCLK source</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SELS_0</name>
                                <description>when LFXT available, otherwise REFOCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELS_1</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELS_2</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELS_3</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELS_4</name>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELS_5</name>
                                <description>when HFXT available, otherwise DCOCLK</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELS_6</name>
                                <description>when HFXT2 available, otherwise DCOCLK</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELS_7</name>
                                <description>for furture use. Defaults to DCOCLK. Do not use to ensure future compatibilities.</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SELA</name>
                        <description>Selects the ACLK source</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SELA_0</name>
                                <description>when LFXT available, otherwise REFOCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELA_1</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELA_2</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELA_3</name>
                                <description>for future use. Defaults to REFOCLK. Not recommended
for use to ensure future compatibilities.</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELA_4</name>
                                <description>for future use. Defaults to REFOCLK. Not recommended
for use to ensure future compatibilities.</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELA_5</name>
                                <description>for future use. Defaults to REFOCLK. Not recommended
for use to ensure future compatibilities.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELA_6</name>
                                <description>for future use. Defaults to REFOCLK. Not recommended
for use to ensure future compatibilities.</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELA_7</name>
                                <description>for future use. Defaults to REFOCLK. Not recommended
