cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
for use to ensure future compatibilities.</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SELB</name>
                        <description>Selects the BCLK source</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SELB_0</name>
                                <description>LFXTCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SELB_1</name>
                                <description>REFOCLK</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIVM</name>
                        <description>MCLK source divider</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DIVM_0</name>
                                <description>f(MCLK)/1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVM_1</name>
                                <description>f(MCLK)/2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVM_2</name>
                                <description>f(MCLK)/4</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVM_3</name>
                                <description>f(MCLK)/8</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVM_4</name>
                                <description>f(MCLK)/16</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVM_5</name>
                                <description>f(MCLK)/32</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVM_6</name>
                                <description>f(MCLK)/64</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVM_7</name>
                                <description>f(MCLK)/128</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIVHS</name>
                        <description>HSMCLK source divider</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DIVHS_0</name>
                                <description>f(HSMCLK)/1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVHS_1</name>
                                <description>f(HSMCLK)/2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVHS_2</name>
                                <description>f(HSMCLK)/4</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVHS_3</name>
                                <description>f(HSMCLK)/8</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVHS_4</name>
                                <description>f(HSMCLK)/16</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVHS_5</name>
                                <description>f(HSMCLK)/32</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVHS_6</name>
                                <description>f(HSMCLK)/64</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVHS_7</name>
                                <description>f(HSMCLK)/128</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIVA</name>
                        <description>ACLK source divider</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DIVA_0</name>
                                <description>f(ACLK)/1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVA_1</name>
                                <description>f(ACLK)/2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVA_2</name>
                                <description>f(ACLK)/4</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVA_3</name>
                                <description>f(ACLK)/8</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVA_4</name>
                                <description>f(ACLK)/16</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVA_5</name>
                                <description>f(ACLK)/32</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVA_6</name>
                                <description>f(ACLK)/64</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVA_7</name>
                                <description>f(ACLK)/128</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIVS</name>
                        <description>SMCLK source divider</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DIVS_0</name>
                                <description>f(SMCLK)/1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVS_1</name>
                                <description>f(SMCLK)/2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVS_2</name>
                                <description>f(SMCLK)/4</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVS_3</name>
                                <description>f(SMCLK)/8</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVS_4</name>
                                <description>f(SMCLK)/16</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVS_5</name>
                                <description>f(SMCLK)/32</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVS_6</name>
                                <description>f(SMCLK)/64</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DIVS_7</name>
                                <description>f(SMCLK)/128</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CSCTL2</name>
                  <displayName>CTL2</displayName>
                  <description>Control 2 Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00010003</resetValue>
                  <fields>
                    <field>
                        <name>LFXTDRIVE</name>
                        <description>LFXT oscillator current can be adjusted to its drive needs</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LFXTDRIVE_0</name>
                                <description>Lowest drive strength and current consumption LFXT oscillator.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXTDRIVE_1</name>
                                <description>Increased drive strength LFXT oscillator.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXTDRIVE_2</name>
                                <description>Increased drive strength LFXT oscillator.</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXTDRIVE_3</name>
                                <description>Maximum drive strength and maximum current consumption LFXT oscillator.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LFXTAGCOFF</name>
                        <description>Disables the automatic gain control of the LFXT crystal</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LFXTAGCOFF_0</name>
                                <description>AGC enabled.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXTAGCOFF_1</name>
                                <description>AGC disabled.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LFXT_EN</name>
                        <description>Turns on the LFXT oscillator regardless if used as a clock resource</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LFXT_EN_0</name>
                                <description>LFXT is on if it is used as a source for ACLK, MCLK, HSMCLK , or SMCLK
and is selected via the port selection and not in bypass mode of operation.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXT_EN_1</name>
                                <description>LFXT is on if LFXT is selected via the port selection and LFXT is not in
bypass mode of operation.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LFXTBYPASS</name>
                        <description>LFXT bypass select</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LFXTBYPASS_0</name>
                                <description>LFXT sourced by external crystal.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXTBYPASS_1</name>
                                <description>LFXT sourced by external square wave.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXTDRIVE</name>
                        <description>HFXT oscillator drive selection</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HFXTDRIVE_0</name>
                                <description>To be used for HFXTFREQ setting 000b</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTDRIVE_1</name>
                                <description>To be used for HFXTFREQ settings 001b to 110b</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXTFREQ</name>
                        <description>HFXT frequency selection</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HFXTFREQ_0</name>
                                <description>1 MHz to 4 MHz</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTFREQ_1</name>
                                <description>>4 MHz to 8 MHz</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTFREQ_2</name>
                                <description>>8 MHz to 16 MHz</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTFREQ_3</name>
                                <description>>16 MHz to 24 MHz</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTFREQ_4</name>
                                <description>>24 MHz to 32 MHz</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTFREQ_5</name>
                                <description>>32 MHz to 40 MHz</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTFREQ_6</name>
                                <description>>40 MHz to 48 MHz</description>
                                <value>6</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXT_EN</name>
                        <description>Turns on the HFXT oscillator regardless if used as a clock resource</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HFXT_EN_0</name>
                                <description>HFXT is on if it is used as a source for MCLK, HSMCLK , or SMCLK and is selected via the port selection and not in bypass mode of operation.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXT_EN_1</name>
                                <description>HFXT is on if HFXT is selected via the port selection and HFXT is not in bypass mode of operation.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXTBYPASS</name>
                        <description>HFXT bypass select</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HFXTBYPASS_0</name>
                                <description>HFXT sourced by external crystal.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTBYPASS_1</name>
                                <description>HFXT sourced by external square wave.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
