cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
            <register>
                  <name>FLCTL_BANK1_RDCTL</name>
                  <displayName>BANK1_RDCTL</displayName>
                  <description>Bank1 Read Control Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RD_MODE</name>
                        <description>Flash read mode control setting for Bank 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RD_MODE_0</name>
                                <description>Normal read mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_1</name>
                                <description>Read Margin 0</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_2</name>
                                <description>Read Margin 1</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_3</name>
                                <description>Program Verify</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_4</name>
                                <description>Erase Verify</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_5</name>
                                <description>Leakage Verify</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_9</name>
                                <description>Read Margin 0B</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_10</name>
                                <description>Read Margin 1B</description>
                                <value>10</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BUFI</name>
                        <description>Enables read buffering feature for instruction fetches to this Bank</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFD</name>
                        <description>Enables read buffering feature for data reads to this Bank</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RD_MODE_STATUS</name>
                        <description>Read mode</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_0</name>
                                <description>Normal read mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_1</name>
                                <description>Read Margin 0</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_2</name>
                                <description>Read Margin 1</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_3</name>
                                <description>Program Verify</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_4</name>
                                <description>Erase Verify</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_5</name>
                                <description>Leakage Verify</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_9</name>
                                <description>Read Margin 0B</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RD_MODE_STATUS_10</name>
                                <description>Read Margin 1B</description>
                                <value>10</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WAIT</name>
                        <description>Number of wait states for read</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>WAIT_0</name>
                                <description>0 wait states</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_1</name>
                                <description>1 wait states</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_2</name>
                                <description>2 wait states</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_3</name>
                                <description>3 wait states</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_4</name>
                                <description>4 wait states</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_5</name>
                                <description>5 wait states</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_6</name>
                                <description>6 wait states</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_7</name>
                                <description>7 wait states</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_8</name>
                                <description>8 wait states</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_9</name>
                                <description>9 wait states</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_10</name>
                                <description>10 wait states</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_11</name>
                                <description>11 wait states</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_12</name>
                                <description>12 wait states</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_13</name>
                                <description>13 wait states</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_14</name>
                                <description>14 wait states</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAIT_15</name>
                                <description>15 wait states</description>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_RDBRST_CTLSTAT</name>
                  <displayName>RDBRST_CTLSTAT</displayName>
                  <description>Read Burst/Compare Control and Status Register</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>START</name>
                        <description>Start of burst/compare operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>MEM_TYPE</name>
                        <description>Type of memory that burst is carried out on</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MEM_TYPE_0</name>
                                <description>Main Memory</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MEM_TYPE_1</name>
                                <description>Information Memory</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MEM_TYPE_3</name>
                                <description>Engineering Memory</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STOP_FAIL</name>
                        <description>Terminate burst/compare operation</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DATA_CMP</name>
                        <description>Data pattern used for comparison against memory read data</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DATA_CMP_0</name>
                                <description>0000_0000_0000_0000_0000_0000_0000_0000</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DATA_CMP_1</name>
                                <description>FFFF_FFFF_FFFF_FFFF_FFFF_FFFF_FFFF_FFFF</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TEST_EN</name>
                        <description>Enable comparison against test data compare registers</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BRST_STAT</name>
                        <description>Status of Burst/Compare operation</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BRST_STAT_0</name>
                                <description>Idle</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BRST_STAT_1</name>
                                <description>Burst/Compare START bit written, but operation pending</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BRST_STAT_2</name>
                                <description>Burst/Compare in progress</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BRST_STAT_3</name>
                                <description>Burst complete (status of completed burst remains in this state unless explicitly cleared by SW)</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CMP_ERR</name>
                        <description>Burst/Compare Operation encountered atleast one data</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ADDR_ERR</name>
                        <description>Burst/Compare Operation was terminated due to access to</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLR_STAT</name>
                        <description>Clear status bits 19-16 of this register</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_RDBRST_STARTADDR</name>
                  <displayName>RDBRST_STARTADDR</displayName>
                  <description>Read Burst/Compare Start Address Register</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>START_ADDRESS</name>
                        <description>Start Address of Burst Operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x15</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_RDBRST_LEN</name>
                  <displayName>RDBRST_LEN</displayName>
                  <description>Read Burst/Compare Length Register</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BURST_LENGTH</name>
                        <description>Length of Burst Operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x15</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_RDBRST_FAILADDR</name>
                  <displayName>RDBRST_FAILADDR</displayName>
                  <description>Read Burst/Compare Fail Address Register</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>FAIL_ADDRESS</name>
                        <description>Reflects address of last failed compare</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x15</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_RDBRST_FAILCNT</name>
                  <displayName>RDBRST_FAILCNT</displayName>
                  <description>Read Burst/Compare Fail Count Register</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>FAIL_COUNT</name>
                        <description>Number of failures encountered in burst operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x11</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
