cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
            <register>
                  <name>FLCTL_PRGBRST_DATA1_2</name>
                  <displayName>PRGBRST_DATA1_2</displayName>
                  <description>Program Burst Data1 Register2</description>
                  <addressOffset>0x78</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA1_3</name>
                  <displayName>PRGBRST_DATA1_3</displayName>
                  <description>Program Burst Data1 Register3</description>
                  <addressOffset>0x7C</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA2_0</name>
                  <displayName>PRGBRST_DATA2_0</displayName>
                  <description>Program Burst Data2 Register0</description>
                  <addressOffset>0x80</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 2</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA2_1</name>
                  <displayName>PRGBRST_DATA2_1</displayName>
                  <description>Program Burst Data2 Register1</description>
                  <addressOffset>0x84</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 2</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA2_2</name>
                  <displayName>PRGBRST_DATA2_2</displayName>
                  <description>Program Burst Data2 Register2</description>
                  <addressOffset>0x88</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 2</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA2_3</name>
                  <displayName>PRGBRST_DATA2_3</displayName>
                  <description>Program Burst Data2 Register3</description>
                  <addressOffset>0x8C</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 2</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA3_0</name>
                  <displayName>PRGBRST_DATA3_0</displayName>
                  <description>Program Burst Data3 Register0</description>
                  <addressOffset>0x90</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 3</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA3_1</name>
                  <displayName>PRGBRST_DATA3_1</displayName>
                  <description>Program Burst Data3 Register1</description>
                  <addressOffset>0x94</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 3</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA3_2</name>
                  <displayName>PRGBRST_DATA3_2</displayName>
                  <description>Program Burst Data3 Register2</description>
                  <addressOffset>0x98</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 3</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_PRGBRST_DATA3_3</name>
                  <displayName>PRGBRST_DATA3_3</displayName>
                  <description>Program Burst Data3 Register3</description>
                  <addressOffset>0x9C</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DATAIN</name>
                        <description>Program Burst 128 bit Data Word 3</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_ERASE_CTLSTAT</name>
                  <displayName>ERASE_CTLSTAT</displayName>
                  <description>Erase Control and Status Register</description>
                  <addressOffset>0xA0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>START</name>
                        <description>Start of Erase operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Erase mode selected by application</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MODE_0</name>
                                <description>Sector Erase (controlled by FLTCTL_ERASE_SECTADDR)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MODE_1</name>
                                <description>Mass Erase (includes all Main and Information memory sectors that don't have corresponding WE bits set)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TYPE</name>
                        <description>Type of memory that erase operation is carried out on</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TYPE_0</name>
                                <description>Main Memory</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TYPE_1</name>
                                <description>Information Memory</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TYPE_3</name>
                                <description>Engineering Memory</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STATUS</name>
                        <description>Status of erase operations in the Flash memory</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>STATUS_0</name>
                                <description>Idle (no program operation currently active)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATUS_1</name>
                                <description>Erase operation triggered to START but pending</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATUS_2</name>
                                <description>Erase operation in progress</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>STATUS_3</name>
                                <description>Erase operation completed (status of completed erase remains in this state unless explicitly cleared by SW)</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADDR_ERR</name>
                        <description>Erase Operation was terminated due to attempted erase of reserved memory address</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLR_STAT</name>
                        <description>Clear status bits 18-16 of this register</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_ERASE_SECTADDR</name>
                  <displayName>ERASE_SECTADDR</displayName>
                  <description>Erase Sector Address Register</description>
                  <addressOffset>0xA4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SECT_ADDRESS</name>
                        <description>Address of Sector being Erased</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x16</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_BANK0_INFO_WEPROT</name>
                  <displayName>BANK0_INFO_WEPROT</displayName>
                  <description>Information Memory Bank0 Write/Erase Protection Register</description>
                  <addressOffset>0xB0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000003</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>PROT0</name>
                        <description>Protects Sector 0 from program or erase</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT1</name>
                        <description>Protects Sector 1 from program or erase</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
