cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
            <register>
                  <name>ADC14IV</name>
                  <displayName>IV</displayName>
                  <description>Interrupt Vector Register</description>
                  <addressOffset>0x154</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14IV</name>
                        <description>ADC14 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_2</name>
                                <description>Interrupt Source: ADC14MEMx overflow; Interrupt Flag: ADC14OVIFG; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_4</name>
                                <description>Interrupt Source: Conversion time overflow; Interrupt Flag: ADC14TOVIFG</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_6</name>
                                <description>Interrupt Source: ADC14 window high interrupt flag; Interrupt Flag: ADC14HIIFG</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_8</name>
                                <description>Interrupt Source: ADC14 window low interrupt flag; Interrupt Flag: ADC14LOIFG</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_10</name>
                                <description>Interrupt Source: ADC14 in-window interrupt flag; Interrupt Flag: ADC14INIFG</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_12</name>
                                <description>Interrupt Source: ADC14MEM0 interrupt flag; Interrupt Flag: ADC14IFG0</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_14</name>
                                <description>Interrupt Source: ADC14MEM1 interrupt flag; Interrupt Flag: ADC14IFG1</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_16</name>
                                <description>Interrupt Source: ADC14MEM2 interrupt flag; Interrupt Flag: ADC14IFG2</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_18</name>
                                <description>Interrupt Source: ADC14MEM3 interrupt flag; Interrupt Flag: ADC14IFG3</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_20</name>
                                <description>Interrupt Source: ADC14MEM4 interrupt flag; Interrupt Flag: ADC14IFG4</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_22</name>
                                <description>Interrupt Source: ADC14MEM5 interrupt flag; Interrupt Flag: ADC14IFG5</description>
                                <value>22</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_24</name>
                                <description>Interrupt Source: ADC14MEM6 interrupt flag; Interrupt Flag: ADC14IFG6</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_26</name>
                                <description>Interrupt Source: ADC14MEM7 interrupt flag; Interrupt Flag: ADC14IFG7</description>
                                <value>26</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_28</name>
                                <description>Interrupt Source: ADC14MEM8 interrupt flag; Interrupt Flag: ADC14IFG8</description>
                                <value>28</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_30</name>
                                <description>Interrupt Source: ADC14MEM9 interrupt flag; Interrupt Flag: ADC14IFG9</description>
                                <value>30</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_32</name>
                                <description>Interrupt Source: ADC14MEM10 interrupt flag; Interrupt Flag: ADC14IFG10</description>
                                <value>32</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_34</name>
                                <description>Interrupt Source: ADC14MEM11 interrupt flag; Interrupt Flag: ADC14IFG11</description>
                                <value>34</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_36</name>
                                <description>Interrupt Source: ADC14MEM12 interrupt flag; Interrupt Flag: ADC14IFG12</description>
                                <value>36</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_38</name>
                                <description>Interrupt Source: ADC14MEM13 interrupt flag; Interrupt Flag: ADC14IFG13</description>
                                <value>38</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_40</name>
                                <description>Interrupt Source: ADC14MEM14 interrupt flag; Interrupt Flag: ADC14IFG14</description>
                                <value>40</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_42</name>
                                <description>Interrupt Source: ADC14MEM15 interrupt flag; Interrupt Flag: ADC14IFG15</description>
                                <value>42</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_44</name>
                                <description>Interrupt Source: ADC14MEM16 interrupt flag; Interrupt Flag: ADC14IFG16</description>
                                <value>44</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_46</name>
                                <description>Interrupt Source: ADC14MEM17 interrupt flag; Interrupt Flag: ADC14IFG17</description>
                                <value>46</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_48</name>
                                <description>Interrupt Source: ADC14MEM18 interrupt flag; Interrupt Flag: ADC14IFG18</description>
                                <value>48</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_50</name>
                                <description>Interrupt Source: ADC14MEM19 interrupt flag; Interrupt Flag: ADC14IFG19</description>
                                <value>50</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_52</name>
                                <description>Interrupt Source: ADC14MEM20 interrupt flag; Interrupt Flag: ADC14IFG20</description>
                                <value>52</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_54</name>
                                <description>Interrupt Source: ADC14MEM22 interrupt flag; Interrupt Flag: ADC14IFG22</description>
                                <value>54</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_56</name>
                                <description>Interrupt Source: ADC14MEM22 interrupt flag; Interrupt Flag: ADC14IFG22</description>
                                <value>56</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_58</name>
                                <description>Interrupt Source: ADC14MEM23 interrupt flag; Interrupt Flag: ADC14IFG23</description>
                                <value>58</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_60</name>
                                <description>Interrupt Source: ADC14MEM24 interrupt flag; Interrupt Flag: ADC14IFG24</description>
                                <value>60</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_62</name>
                                <description>Interrupt Source: ADC14MEM25 interrupt flag; Interrupt Flag: ADC14IFG25</description>
                                <value>62</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_64</name>
                                <description>Interrupt Source: ADC14MEM26 interrupt flag; Interrupt Flag: ADC14IFG26</description>
                                <value>64</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_66</name>
                                <description>Interrupt Source: ADC14MEM27 interrupt flag; Interrupt Flag: ADC14IFG27</description>
                                <value>66</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_68</name>
                                <description>Interrupt Source: ADC14MEM28 interrupt flag; Interrupt Flag: ADC14IFG28</description>
                                <value>68</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_70</name>
                                <description>Interrupt Source: ADC14MEM29 interrupt flag; Interrupt Flag: ADC14IFG29</description>
                                <value>70</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_72</name>
                                <description>Interrupt Source: ADC14MEM30 interrupt flag; Interrupt Flag: ADC14IFG30</description>
                                <value>72</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_74</name>
                                <description>Interrupt Source: ADC14MEM31 interrupt flag; Interrupt Flag: ADC14IFG31</description>
                                <value>74</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IV_76</name>
                                <description>Interrupt Source: ADC14RDYIFG interrupt flag; Interrupt Flag: ADC14RDYIFG; Interrupt Priority: Lowest</description>
                                <value>76</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
