cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
        </registers>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>CPUID</name>
                  <displayName>CPUID</displayName>
                  <description>CPUID Base Register</description>
                  <addressOffset>0xD00</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x410fc241</resetValue>
                  <fields>
                    <field>
                        <name>REVISION</name>
                        <description>Implementation defined revision number.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PARTNO</name>
                        <description>Number of processor within family.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0xC</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CONSTANT</name>
                        <description>Reads as 0xC</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VARIANT</name>
                        <description>Implementation defined variant number.</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IMPLEMENTER</name>
                        <description>Implementor code.</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ICSR</name>
                  <displayName>ICSR</displayName>
                  <description>Interrupt Control State Register</description>
                  <addressOffset>0xD04</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>VECTACTIVE</name>
                        <description>Active ISR number field. Reset clears the VECTACTIVE field.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x9</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RETTOBASE</name>
                        <description>This bit is 1 when the set of all active exceptions minus the IPSR_current_exception yields the empty set.</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VECTPENDING</name>
                        <description>Pending ISR number field. VECTPENDING contains the interrupt number of the highest priority pending ISR.</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x6</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ISRPENDING</name>
                        <description>Interrupt pending flag. Excludes NMI and faults.</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>interrupt not pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ISRPREEMPT</name>
                        <description>You must only use this at debug time. It indicates that a pending interrupt is to be taken in the next running cycle. If C_MASKINTS is clear in the Debug Halting Control and Status Register, the interrupt is serviced.</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>a pending exception is not serviced.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>a pending exception is serviced on exit from the debug halt state</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PENDSTCLR</name>
                        <description>Clear pending SysTick bit</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>do not clear pending SysTick</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>clear pending SysTick</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PENDSTSET</name>
                        <description>Set a pending SysTick bit.</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>do not set pending SysTick</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>set pending SysTick</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PENDSVCLR</name>
                        <description>Clear pending pendSV bit</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>do not clear pending pendSV</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>clear pending pendSV</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PENDSVSET</name>
                        <description>Set pending pendSV bit.</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>do not set pending pendSV</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>set pending PendSV</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>NMIPENDSET</name>
                        <description>Set pending NMI bit. NMIPENDSET pends and activates an NMI. Because NMI is the highest-priority interrupt, it takes effect as soon as it registers.</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>do not set pending NMI</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>set pending NMI</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>VTOR</name>
                  <displayName>VTOR</displayName>
                  <description>Vector Table Offset Register</description>
                  <addressOffset>0xD08</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>TBLOFF</name>
                        <description>Vector table base offset field. Contains the offset of the table base from the bottom of the SRAM or CODE space.</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x16</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TBLBASE</name>
                        <description>Table base is in Code (0) or RAM (1).</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AIRCR</name>
                  <displayName>AIRCR</displayName>
                  <description>Application Interrupt/Reset Control Register</description>
                  <addressOffset>0xD0C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xfa050000</resetValue>
                  <resetMask>0xffff7fff</resetMask>
                  <fields>
                    <field>
                        <name>VECTRESET</name>
                        <description>System Reset bit. Resets the system, with the exception of debug components. The VECTRESET bit self-clears. Reset clears the VECTRESET bit. For debugging, only write this bit when the core is halted.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>VECTCLRACTIVE</name>
                        <description>Clears all active state information for active NMI, fault, and interrupts.  It is the responsibility of the application to reinitialize the stack. The VECTCLRACTIVE bit is for returning to a known state during debug. The VECTCLRACTIVE bit self-clears. IPSR is not cleared by this operation. So, if used by an application, it must only be used at the base level of activation, or within a system handler whose active bit can be set.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SYSRESETREQ</name>
                        <description>Causes a signal to be asserted to the outer system that indicates a reset is requested. Intended to force a large system reset of all major components except for debug. Setting this bit does not prevent Halting Debug from running.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PRIGROUP</name>
                        <description>Interrupt priority grouping field. The PRIGROUP field is a binary point position indicator for creating subpriorities for exceptions that share the same pre-emption level. It divides the PRI_n field in the Interrupt Priority Register into a pre-emption level and a subpriority level. The binary point is a left-of value. This means that the PRIGROUP value represents a point starting at the left of the Least Significant Bit (LSB). This is bit [0] of 7:0. The lowest value might not be 0 depending on the number of bits allocated for priorities, and implementation choices</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDIANESS</name>
                        <description>Data endianness bit. ENDIANNESS is sampled from the BIGEND input port during reset. You cannot change ENDIANNESS outside of reset.</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>little endian</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>big endian</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VECTKEY</name>
                        <description>Register key. Writing to this register requires 0x5FA in the VECTKEY field. Otherwise the write value is ignored.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SCR</name>
                  <displayName>SCR</displayName>
                  <description>System Control Register</description>
                  <addressOffset>0xD10</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>SLEEPONEXIT</name>
                        <description>Sleep on exit when returning from Handler mode to Thread mode. Enables interrupt driven applications to avoid returning to empty main application.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>do not sleep when returning to thread mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>sleep on ISR exit</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SLEEPDEEP</name>
                        <description>Sleep deep bit.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>not OK to turn off system clock</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>indicates to the system that Cortex-M4 clock can be stopped. Setting this bit causes the SLEEPDEEP port to be asserted when the processor can be stopped.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEVONPEND</name>
                        <description>When enabled, this causes WFE to wake up when an interrupt moves from inactive to pended. Otherwise, WFE only wakes up from an event signal, external and SEV instruction generated. The event input, RXEV, is registered even when not waiting for an event, and so effects the next WFE.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
