cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P401M.svd
            <register>
                  <name>SYS_SRAM_BANKEN</name>
                  <displayName>SRAM_BANKEN</displayName>
                  <description>SRAM Bank Enable Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x000000ff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BNK0_EN</name>
                        <description>SRAM Bank0 enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BNK1_EN</name>
                        <description>SRAM Bank1 enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK1_EN_0</name>
                                <description>Disables Bank1 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK1_EN_1</name>
                                <description>Enables Bank1 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK2_EN</name>
                        <description>SRAM Bank1 enable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK2_EN_0</name>
                                <description>Disables Bank2 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK2_EN_1</name>
                                <description>Enables Bank2 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK3_EN</name>
                        <description>SRAM Bank1 enable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK3_EN_0</name>
                                <description>Disables Bank3 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK3_EN_1</name>
                                <description>Enables Bank3 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK4_EN</name>
                        <description>SRAM Bank1 enable</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK4_EN_0</name>
                                <description>Disables Bank4 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK4_EN_1</name>
                                <description>Enables Bank4 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK5_EN</name>
                        <description>SRAM Bank1 enable</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK5_EN_0</name>
                                <description>Disables Bank5 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK5_EN_1</name>
                                <description>Enables Bank5 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK6_EN</name>
                        <description>SRAM Bank1 enable</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK6_EN_0</name>
                                <description>Disables Bank6 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK6_EN_1</name>
                                <description>Enables Bank6 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK7_EN</name>
                        <description>SRAM Bank1 enable</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK7_EN_0</name>
                                <description>Disables Bank7 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK7_EN_1</name>
                                <description>Enables Bank7 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SRAM_RDY</name>
                        <description>SRAM ready</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>SRAM_RDY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SRAM_RDY_0</name>
                                <description>SRAM is not ready for accesses. Banks are undergoing an enable or disable sequence, and reads or writes to SRAM are stalled until the banks are ready</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SRAM_RDY_1</name>
                                <description>SRAM is ready for accesses. All SRAM banks are enabled/disabled according to values of bits 7:0 of this register</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SRAM_BANKRET</name>
                  <displayName>SRAM_BANKRET</displayName>
                  <description>SRAM Bank Retention Control Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x000000ff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BNK0_RET</name>
                        <description>Bank0 retention</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BNK1_RET</name>
                        <description>Bank1 retention</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK1_RET_0</name>
                                <description>Bank1 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK1_RET_1</name>
                                <description>Bank1 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK2_RET</name>
                        <description>Bank2 retention</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK2_RET_0</name>
                                <description>Bank2 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK2_RET_1</name>
                                <description>Bank2 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK3_RET</name>
                        <description>Bank3 retention</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK3_RET_0</name>
                                <description>Bank3 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK3_RET_1</name>
                                <description>Bank3 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK4_RET</name>
                        <description>Bank4 retention</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK4_RET_0</name>
                                <description>Bank4 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK4_RET_1</name>
                                <description>Bank4 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK5_RET</name>
                        <description>Bank5 retention</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK5_RET_0</name>
                                <description>Bank5 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK5_RET_1</name>
                                <description>Bank5 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK6_RET</name>
                        <description>Bank6 retention</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK6_RET_0</name>
                                <description>Bank6 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK6_RET_1</name>
                                <description>Bank6 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK7_RET</name>
                        <description>Bank7 retention</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK7_RET_0</name>
                                <description>Bank7 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK7_RET_1</name>
                                <description>Bank7 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SRAM_RDY</name>
                        <description>SRAM ready</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>SRAM_RDY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SRAM_RDY_0</name>
                                <description>SRAM banks are being set up for retention. Entry into LPM3, LPM4 should not be attempted until this bit is set to 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SRAM_RDY_1</name>
                                <description>SRAM is ready for accesses. All SRAM banks are enabled/disabled for retention according to values of bits 7:0 of this register</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_FLASH_SIZE</name>
                  <displayName>FLASH_SIZE</displayName>
                  <description>Flash Size Register</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SIZE</name>
                        <description>Flash User Region size</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_DIO_GLTFLT_CTL</name>
                  <displayName>DIO_GLTFLT_CTL</displayName>
                  <description>Digital I/O Glitch Filter Control Register</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000001</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>GLTCH_EN</name>
                        <description>Glitch filter enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>GLTCH_EN_0</name>
                                <description>Disables glitch filter on the digital I/Os</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>GLTCH_EN_1</name>
                                <description>Enables glitch filter on the digital I/Os</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SECDATA_UNLOCK</name>
                  <displayName>SECDATA_UNLOCK</displayName>
                  <description>IP Protected Secure Zone Data Access Unlock Register</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>UNLKEY</name>
                        <description>Unlock key</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_MASTER_UNLOCK</name>
                  <displayName>MASTER_UNLOCK</displayName>
                  <description>Master Unlock Register</description>
                  <addressOffset>0x1000</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>UNLKEY</name>
                        <description>Unlock Key</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1</dimIndex>
                  <name>SYS_BOOTOVER_REQ[%s]</name>
                  <displayName>BOOTOVER_REQ[%s]</displayName>
                  <description>Boot Override Request Register</description>
                  <addressOffset>0x1004</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>REGVAL</name>
                        <description>Value set by debugger, read and clear by the CPU</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
